SET SQL_SAFE_UPDATES = 0;

delete from `Исполнитель-Музыкант`;
delete from `Песня-Исполнитель`;
delete from `Альбом-Песня`;
delete from `Студия-Альбом`;
delete from `Музыкант`;
delete from `Исполнитель`;
delete from `Песня`;
delete from `Альбом`;
delete from `Студия/лейбл`;
delete from `Users`;


insert into Users
values
(1, 1, "admin", "admin"),
(2, 2, "student", "student");

insert into Музыкант
values 
(1, "Макс Корж", 31, "Белоруссия"),
(2, "Дуа Липа", 25, "Великобритания"),
(3, "Адам Ричард Вайлс", 36, "Великобритания"),
(4, "Эйбел Макконен Тесфайе", 30, "Канада"),
(5, "Тома Бангальтер", 45, "Франция"),
(6, "Гийом-Эммануэль Поль де Омем-Кристо", 46, "Франция"),
(7, "Адель Лори Блу Эдкинс", 32, "Великобритания"),
(8, "Эдвард Кристофер Ширан", 29, "Великобритания"),
(9, "Кэтрин Элизабет Хадсон", 36, "США"),
(10, "Адам Ноа Левин", 41, "США"),
(11, "Белкалис Марленис Альманзар", 28, "США"),
(12, "Кирилл Тимошенко", 23, "Украина"),
(13, "Тревор Дэниел Нейл", 26, "США");
/*ID Музыканта, Имя, Возраст, Страна*/

insert into Исполнитель
values 
(1, "Макс Корж", "https://open.spotify.com/artist/5meD8C7oGK5yUEY2T7ZZ7W?si=YThHO92yQ1W1Z-wVvokSJQ", 1403625, 1030778, null),
(2, "Dua Lipa", "https://open.spotify.com/artist/6M2wZ9GZgrQXHCFfjv46we?si=0oYSBCSkRHO2OMKjxLlOeQ", 20297670, 548000544, null),
(3, "Calvin Harris", "https://open.spotify.com/artist/7CajNmpbOovFoOoasH2HaY?si=kS43Rdl3TBCuu9KMqy0Y1g", 20766102, 36745801, null),
(4, "The Weeknd", "https://open.spotify.com/artist/1Xyo4u8uXC1ZmMpatF05PJ?si=BBHOvpRXTDWe8K5LV_m96w", 25241546, 59412239, null),
(5, "Daft Punk", "https://open.spotify.com/artist/4tZwfgrHOc3mvqYlEYSvVi?si=CeNANERRT9mnjNMqZe-XQw", 6803059, 11997200, null),
(6, "Adele", "https://open.spotify.com/artist/4dpARuHxo51G3z768sgnrY?si=NuE3xctLSdeGC78_JdU_ww", 23818502, 24440149, null),
(7, "Ed Sheeran", "https://open.spotify.com/artist/6eUKZXaKkcviH0Ku9w2n3V?si=rs4OMam1QZ6PGewQVlr4vg", 71310894, 51912568, null),
(8, "Katy Perry", "https://open.spotify.com/artist/6jJ0s89eD6GaHleKKya26X?si=nEHLcbsBQ1CIGHW9fqmwYQ", 16509702, 34819071, null),
(9, "Maroon 5", "https://open.spotify.com/artist/04gDigrS5kc9YWfZHwBETP?si=VGoCmjyZSVW8UzzFiLp7QQ", 27493671, 44128868, null),
(10, "Cardi B", "https://open.spotify.com/artist/4kYSro6naA4h99UJvo89HB?si=Kancw1XZRyOeVUzoWX_zpA", 13020062, 50359032, null),
(11, "Пошлая Молли", "https://open.spotify.com/artist/0xByDfltDVpk6LDsUMHyI2?si=ql6Kq03gR8GgVkv_A4HQbQ", 291543, 333248, null),
(12, "Trevor Daniel", "https://open.spotify.com/artist/7uaIm6Pw7xplS8Dy06V6pT?si=9-3-HNu9Qxysh3TypCEBUw", 494129, 14787827, null),
(13, "Intelligency", "https://open.spotify.com/artist/6DdgtZYlUGNzjqkdCqvmfB?si=fh9LnyQlReSUYw3rBnx3FA", 17118, 501533, null),
(14, "Mr.Kitty", "https://open.spotify.com/artist/0pWwt5vGNzezEhfAcc420Y?si=WyfbnaL2R8eDEvrPBQvcBQ", 62031, 399508, null);
/*ID Исполнителя, Название/псевдоним, Ссылка на исполнителя, Количество подписчиков на Spotify, Количество прослушиваний за месяц на Spotify, Место в топе исполнителей*/

insert into `Исполнитель-Музыкант`
values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(5, 6),
(6, 7),
(7, 8),
(8, 9),
(9, 10),
(10, 11),
(11, 12),
(12, 13);

insert into Песня
values 
(1, "Жить в кайф", 2013, "Хип-хоп/рэп", "русский", 36297920, 239000, 3142196, 5, 4, null),
(2, "Горы по колено", 2017, "Хип-хоп/рэп", "русский", 60566785, 638000, 5485034, 6, 5, null),
(3, "Слово пацана", 2014, "Хип-хоп/рэп", "русский", 37213366, 353000, 2251518, 4, 4, null),
(4, "Малый повзрослел", 2016, "Рэп, Хип-хоп/рэп", "русский", 128553838, 1100000, 14120322, 6, 5, null),
(5, "Don't Start Now", 2020, "Поп-музыка", "английский", 411818588, 4900000, 1168168050, 10, 7, null),
(6, "Hallucinate", 2020, "Поп-музыка", "английский", 34779483, 695000, 101585393, 4, 6, null),
(7, "Break My Heart", 2020, "Танцевальная/электронная музыка", "английский", 264499440, 3400000, 474718798, 9, 7, null),
(8, "One Kiss", 2017, "Евродэнс, Дип-хаус, Данс-поп, Фанки-хаус, Танцевальная/электронная музыка", "английский", 682561203, 3600000, 1096661806, 10, 7, null),
(9, "My Way", 2016, "Танцевальная/электронная музыка", "английский", 377225661, 2000000, 666076660, 9, 6, null),
(10, "Acceptable in the 80's", 2007, "Танцевальная/электронная музыка, Поп-музыка", "английский", 14761580, 101000, 32672389, 6, 4, null),
(11, "Blinding Lights", 2019, "Синтвейв, Ритм-н-блюз/соул", "английский", 271077304, 4300000, 1599023537, 10, 8, null),
(12, "Feel It Coming", 2017, "Поп-музыка, Диско", "английский", 740721364, 3800000, 986001396, 10, 6, null),
(13, "Starboy", 2016, "Синти-поп, ‎r'n'b", "английский", 1767227596, 7800000, 1444753570, 10, 7, null),
(14, "Can't Feel My Face", 2018, "Поп-музыка", "английский", 1117634039, 5100000, 1070693894, 9, 6, null),
(15, "One More Time", 2000, "Хаус, Танцевальная/электронная музыка", "английский", 276873444, 1500000, 265491309, 9, 6, null),
(16, "Harder Better Faster Stronger", 2001, "Танцевальная/электронная музыка", "английский", 94651758, 772000, 174264980, 8, 6, null),
(17, "Rolling In The Deep", 2011, "Поп", "английский", 1740809467, 7500000, 738337677, 8, 6, null),
(18, "Skyfall", 2012, "Поп", "английский", 411395445, 2200000, 167815806, 8, 6, null),
(19, "Hello", 2015, "Барокко-поп, ‎соул", "английский", 2729425539, 15000000, 1065959575, 9, 6, null),
(20, "Someone Like You", 2011, "Поп, соул", "английский", 1578174554, 7200000, 887371334, 10, 6, null),
(21, "Shape of You", 2017, "Поп", "английский", 5043362277, 24000000, 2629308140, 10, 7, null),
(22, "I Kissed A Girl", 2008, "Поп-рок, Поп-музыка", "английский", 200110322, 1500000, 310729120, 9, 6, null),
(23, "Roar", 2013, "Поп-музыка", "английский", 3200744050, 12000000, 575141430, 9, 6, null),
(24, "Firework", 2016, "Танцевальная/электронная музыка, Тин-поп, Рок, Поп-музыка", "английский", 1267367316, 4800000, 466416731, 9, 6, null),
(25, "Hot N Cold", 2008, "Поп-музыка", "английский", 996781164, 3900000, 267733654, 8, 5, null),
(26, "Sugar", 2015, "диско; фанк-поп; ‎соул", "английский", 3311374305, 12000000, 1061043396, 9, 6, null),
(27, "Animals", 2014, "Поп-музыка", "английский", 689997498, 4100000, 631755271, 9, 6, null),
(28, "One More Night", 2012, "Поп-музыка", "английский", 889359228, 3400000, 405039296, 8, 5, null),
(29, "Girls Like You", 2017, "Поп-музыка", "английский", 2868717291, 17000000, 1194659813, 10, 6, null),
(30, "Нон стоп", 2017, "Альтернативная музыка/инди, Поп-музыка", "русский", 3080553, 24000, 3010907, 5, 4, null),
(31, "Самый лучший эмо панк", 2020, "Альтернативная музыка/инди", "русский", 410573, 7900, 737944, 4, 4, null),
(32, "Ты разбила папину машину", 2020, "Альтернативная музыка/инди", "русский", 4321350, 155000, 612527, 4, 4, null),
(33, "Falling", 2018, "Поп-музыка", "английский", 163187006, 3500000, 899563235, 10, 7, null),
(34, "August", 2019, "Даунтемпо", "английский", 19807881, 283000, 11890972, 9, 5, null),
(35, "After Dark", 2014, "Альтернативная музыка/инди", "английский", 19223322, 431000, 13562891, 6, 5, null);
/*ID, Название, Год, Жанр, Язык, YouTube, лайков на YouTube, Количество Spotify, Deezer, Популярность Spotify, Номер в топе этой библиотеке*/
call `Пересчёт топа`;

insert into `Песня-Исполнитель`
values
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 2),
(6, 2),
(7, 2),
(8, 2),
(8, 3),
(9, 3),
(10, 3),
(11, 4),
(12, 4),
(12, 5),
(13, 4),
(13, 5),
(14, 4),
(15, 5),
(16, 5),
(17, 6),
(18, 6),
(19, 6),
(20, 6),
(21, 7),
(22, 8),
(23, 8),
(24, 8),
(25, 8),
(26, 9),
(27, 9),
(28, 9),
(29, 9),
(29, 10),
(30, 11),
(31, 11),
(32, 11),
(33, 12),
(34, 13),
(35, 14);

insert into Альбом
values 
(1, "Жить в кайф", "Хип-хоп/рэп", 2013, null),
(2, "Малый повзрослел, Ч. 2", "Хип-хоп/рэп", 2017, null),
(3, "Домашний", "Хип-хоп/рэп", 2014, null),
(4, "Малый повзрослел, ч. 1", "Хип-хоп/рэп", 2016, null),
(5, "Future Nostalgia", " диско, поп, электро, данс-поп", 2020, null),
(6, "One Kiss", "Евродэнс, Дип-хаус, Данс-поп, Фанки-хаус, Танцевальная/электронная музыка", 2017, null),
(7, "My Way", "Танцевальная/электронная музыка", 2016, null),
(8, "I Created Disco", "Электронная танцевальная музыка, Диско, Хаус, Электро-хаус, Синти-поп, Ню-диско, Электроклэш", 2007, null),
(9, "After Hours", "Ритм-энд-блюз, Дрим-поп, Новая волна", 2020, null),
(10, "Starboy", "Современный ритм-н-блюз, Поп-музыка", 2016, null),
(11, "Beauty Behind The Madness", "	поп, R&B, PBR&B", 2015, null),
(12, "Discovery", "Хаус, Диско, Французский хаус, Синти-поп, Ню-диско, Гараж-хаус", 2001, null),
(13, "21", "поп, соул, ритм-н-блюз", 2011, null),	
(14, "Skyfall", "Поп", 2012, null),
(15, "25", "Поп-музыка, Соул, Ритм-энд-блюз, Современный ритм-н-блюз, Народная музыка", 2015, null),
(16, "%", "Поп-музыка, Народная музыка", 2017, null),
(17, "One of the Boys", "Поп-музыка, Рок-музыка, Поп-рок, Данс-поп", 2008, null),
(18, "Prism", "поп-музыка", 2013, null),
(19, "Firework", "Танцевальная/электронная музыка, Тин-поп, Рок, Поп-музыка", 2016, null),
(20, "V", "Поп-музыка, Поп-рок, Электро, Электропоп, Данс-поп, Дэнс-рок", 2014, null),
(21, "Overexposed", "Поп-музыка, Поп-рок, Данс-поп, Синти-поп, Фанк-рок", 2012, null),
(22, "Red Pill Blues", "Поп-музыка, Современный ритм-н-блюз, Софт-рок, Фанк", 2017, null),
(23, "8 способов как бросить…", "Альтернативная музыка/инди, Поп-музыка", 2017, null),
(24, "Paycheck", "Альтернативная музыка/инди", 2020, null),
(25, "Homesick", "Поп-музыка", 2018, null),
(26, "Renovatio", "Поп-музыка, Даунтемпо", 2019, null),
(27, "Time", "Альтернативная музыка/инди", 2014, null);
/*ID Альбома, Название, Жанр, Год выхода, Место в топе альбомов*/
 
insert into `Альбом-Песня`
values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(5, 6),
(5, 7),
(6, 8),
(7, 9),
(8, 10),
(9, 11),
(10, 12),
(10, 13),
(11, 14),
(12, 15),
(12, 16),
(13, 17),
(14, 18),
(15, 19),
(13, 20),
(16, 21),
(17, 22),
(18, 23),
(19, 24),
(17, 25),
(20, 26),
(20, 27),
(21, 28),
(22, 29),
(23, 30),
(24, 31),
(24, 32),
(25, 33),
(26, 34),
(27, 35);

insert into `Студия/лейбл`
values 
(1, "Respect Production", 2000),
(2, "Warner Records/Warner Music", 1958),
(3, "Columbia Records", 1888),
(4, "Republic Records", 1995),
(5, "Virgin Records", 1972),
(6, "XL Recordings", 1989),
(7, "XO Records", 2012),
(8, "Atlantic Records UK", 2004),
(9, "Capitol Records", 1942),
(10, "Interscope Records", 1990),
(11, "Octone Records", 2007),
(12, "A&M Records", 1962),
(13, "222 Records", 2012),
(14, "Poshlaya Molly", 2017),
(15, "Warner Music Russia", 2013),
(16, "MediaCube", 1998),
(17, "Negative Gain Productions", 1997),
(18, "Alamo Records", 2018);
/*ID Студии/лейбла, Название, Год основания*/

insert into `Студия-Альбом`
values 
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(2, 5),
(3, 6),
(3, 7),
(3, 8),
(3, 13),
(3, 14),
(3, 15),
(4, 9),
(4, 10),
(4, 11),
(5, 12),
(6, 13),
(6, 14),
(6, 15),
(7, 9),
(7, 10),
(7, 11),
(8, 16),
(9, 17),
(9, 18),
(9, 19),
(10, 20),
(10, 22),
(11, 21),
(12, 21),
(13, 20),
(13, 22),
(14, 23),
(15, 24),
(16, 26),
(17, 27),
(18, 25);